#+TITLE: (CSP) Comunicación de Procesos Secuenciales
**** Ejemplo 1 - Callback sincrónica
     #+BEGIN_SRC js :results output
       // quizás podriamos haber usado condicionales ó un switch case para el tipo de callback... pero ese no era el objetivo

       function saludoFormal(nombre){
           console.log('Hola ' + nombre);
       }

       function saludoInformal(nombre){
           console.log('olis ' + nombre);
       }

       function saludar(callback, nombre){
           callback(nombre);
       }

       saludar(saludoFormal, "carlitos");

       saludar(saludoInformal, "carlitos");
     #+END_SRC

     #+RESULTS:
     : Hola carlitos
     : olis carlitos
**** Ejemplo 2 - Callback asincrónica con setTimeout
     #+BEGIN_SRC js :results output
       setTimeout(function(){
           console.log("Ejecuté una callback asincrónica NO bloqueante, luego de 2 segundos")
       }, 2000)

       setTimeout( () => console.log("Ejecuté otra callback asincrónica NO bloqueante, luego de 3 segundos"), 3000)
     #+END_SRC

     #+RESULTS:
     : Ejecuté una callback luego de  2 segundos
     : Ejecuté otra callback luego de 3 segundos
